
dict_holiday = {
    '2019' : [
        [1,1],   #신정
        [2,4],   #설연휴
        [2,5],
        [2,6],
        [3,1],   #삼일절
        [5,6],   #어린이날(일) 대체휴일
        [5,12],  #부처님오신날
        [6,6],   #현충일
        [8,15],  #광복절
        [9,12],  #추석연휴
        [9,13],
        [9,14],
        [10,3],  #개천절
        [10,9],  #한글날
        [12,25]  #성탄절
    ],

    #for test data 
    '2020' : [
        [1,1],   #신정
        [1,24],   #설연휴
        [1,25],
        [1,26],
        [1,27],  #설연휴 대체휴무일
        [3,1],   #삼일절
        [4,16],  #국회의원 선거
        [4,30],  #부처님오신날
        [5,1],   #근로자의 날 
        [5,5],   #어린이날
        [6,6],   #현충일
        [8,15],  #광복절
        [9,30],  #추석연휴
        [10,1],
        [10,2],
        [10,9],  #한글날
        [12,25]  #성탄절
    ]
}
